import { StrictMode } from "react";
import { createRoot } from "react-dom/client";
import App from "./App.tsx";
import { store } from "./store.ts";
import { Provider } from "react-redux";
import "@fontsource/inter/400.css";
import "@fontsource/inter/500.css";
import "@fontsource/inter/700.css";

createRoot(document.getElementById("root")!).render(
  <StrictMode>
    <Provider store={store}>
      <App />
    </Provider>
  </StrictMode>
);

import parseCourse from "./utils/parseTechnionCourse.ts";

(window as any).testCourse = () => {
  const data = {
    general: {
      "מספר מקצוע": "01040031",
      "שם מקצוע": "חשבון אינפיניטסימלי 1מ'",
      סילבוס:
        'מקצועות קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר בלימודי חוץ בשנת הלימודים הנוכחית.\nשדה המספרים הממשיים. גבולות של סדרות ושל פונקציות ממשיות של משתנה יחיד. רציפות ורציפות במידה שווה של פונקציות של משתנה יחיד. הנגזרת, המשפטים היסודיים על נגזרות. נוסחת טיילור ושימושיה. חקירת פונקציות.',
      פקולטה: "הפקולטה למתמטיקה",
      "מסגרת לימודים": "לימודי הסמכה",
      "מקצועות ללא זיכוי נוסף":
        "01040003 01040010 01040012 01040017 01040018 01040036 01040041 01040042 01040087 01040090 01040093 01040195",
      נקודות: "5.5",
      אחראים: 'ד"ר מיכל קליינשטרן',
      הערות:
        "1.יש להירשם אך ורק לקבוצה בה תוכל/י להשתתף, במקרה של חוסת מקום בכיתה, סטודנטים לא יורשו להשתתף בתרגיל או בהרצאה שאינם רשומים אליהם.\n",
      "מועד א": "23-07-2025",
      "מועד ב": "24-08-2025",
      "בוחן מועד א": "30-05-2025 09:00 - 11:00",
    },
    schedule: [
      {
        קבוצה: 11,
        סוג: "תרגול",
        יום: "חמישי",
        שעה: "09:30 - 10:30",
        בניין: "אולמן",
        חדר: 309,
        "מרצה/מתרגל": "מר עומר מויאל",
        "מס.": 11,
      },
      {
        קבוצה: 12,
        סוג: "תרגול",
        יום: "ראשון",
        שעה: "09:30 - 10:30",
        בניין: "אולמן",
        חדר: 307,
        "מרצה/מתרגל": "גב' אפרת אבירם",
        "מס.": 12,
      },
      {
        קבוצה: 11,
        סוג: "הרצאה",
        יום: "ראשון",
        שעה: "12:30 - 14:30",
        בניין: "אולמן",
        חדר: 803,
        "מרצה/מתרגל": 'ד"ר מיכל קליינשטרן',
        "מס.": 10,
      },
      {
        קבוצה: 13,
        סוג: "תרגול",
        יום: "רביעי",
        שעה: "11:30 - 12:30",
        בניין: "אולמן",
        חדר: 309,
        "מרצה/מתרגל": "גב' ניקה פת",
        "מס.": 13,
      },
      {
        קבוצה: 11,
        סוג: "הרצאה",
        יום: "שלישי",
        שעה: "10:30 - 12:30",
        בניין: "אולמן",
        חדר: 307,
        "מרצה/מתרגל": 'ד"ר מיכל קליינשטרן',
        "מס.": 10,
      },
      {
        קבוצה: 12,
        סוג: "תרגול",
        יום: "שני",
        שעה: "10:30 - 12:30",
        בניין: "אולמן",
        חדר: 804,
        "מרצה/מתרגל": "גב' אפרת אבירם",
        "מס.": 12,
      },
      {
        קבוצה: 13,
        סוג: "תרגול",
        יום: "שני",
        שעה: "10:30 - 12:30",
        בניין: "אולמן",
        חדר: 309,
        "מרצה/מתרגל": "גב' ניקה פת",
        "מס.": 13,
      },
      {
        קבוצה: 11,
        סוג: "תרגול",
        יום: "שני",
        שעה: "12:30 - 14:30",
        בניין: "אולמן",
        חדר: 309,
        "מרצה/מתרגל": "מר עומר מויאל",
        "מס.": 11,
      },
    ],
  };
  const res = parseCourse(data as any);
  console.log(res);
  for (const e of res.scheduleEntries) {
    const instances = res.sessionInstances.filter((inst) =>
      e.sessionInstanceIds.find((id) => inst.id === id)
    );
    console.log(e);
    console.log(instances);
  }
};
